example-doc/Models/Sequences/AuthSequenceView.mmd
sequenceDiagram
%%Generated by Modeler - do not change.
autonumber

participant hr_backend as HR Backend <<Application>>

participant activedirectory as ActiveDirectory <<ExternalSystem>>

hr_backend ->> activedirectory : authenticate (user, password)
activate activedirectory

activedirectory -->> hr_backend : OK (UserId)
deactivate activedirectory
