example-doc/Models/Sequences/AuthSequenceView.puml
@startuml
'Generated by Modeler - do not change.
autonumber

participant "HR Backend" as hr_backend <<Application>> 

participant "ActiveDirectory" as activedirectory <<ExternalSystem>> #FFD2BE

hr_backend -> activedirectory : authenticate (user, password)
activate activedirectory

activedirectory --> hr_backend : OK (UserId)
deactivate activedirectory


@enduml
